# # =======================   Tuple   =============================================================================
# Задача 1    tuple_d = (1, 2, 3, 4, 5, 4, 5, 6, 7, 8, 4, 5, 6, 7, 8, 9, 10, 11)

tuple_a = (1, 2, 3, 4, 5)
tuple_b  = (4, 5, 6, 7, 8)
tuple_c = (4, 5, 6, 7, 8, 9, 10, 11)

tuple_d = tuple_a + tuple_b + tuple_c
print('Tuple', '\n', 'Задача 1', '\n', 'tuple_d =', tuple_d)

# ==================================================================================================================
# Задача 2 res = ((4, 3), (5, 3), (4, 3), (5, 3), (6, 2), (7, 2), (8, 2), (4, 3) , (5, 3), (6, 2), (7, 2), (8, 2))

res = []
for i in tuple_d:
    count = tuple_d.count(i)
    if count < 2:
        continue
    res.append((i, count))
print(' Задача 2', '\n', 'res =', tuple(res))

# ==================================================================================================================
# Задача 3 res = ((4, (3, 5, 10)), (5, (4, 6, 11)), (6, (7, 12)), (7, (8, 13)), (8, (9, 14)))

res = []
elements = []
for element in tuple_d:
    count = tuple_d.count(element)
    if count > 1 and element not in elements:
        elements.append(element)
        indexes = []
        for index, item in enumerate(tuple_d):
            if item == element:
                indexes.append(index)
        res.append((element, tuple(indexes)))

print(' Задача 3', '\n', 'res =', tuple(res))

# # =======================   LIST   ===============================================================================
# Задача 1       list_c = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

list_a = [1, 2, 3, 4, 5]
list_b = [6, 7, 8, 9, 10]
list_f = [9, 3, 4, 1, 8, 6, 5, 2, 0, 7]


list_c = list_a + list_b
print('List', '\n', 'Задача 1', '\n', 'list_c =', list_c)

# ==================================================================================================================
#  Задача 2     list_с = [1, 6, 2, 7, 3, 8, 4, 9, 5, 10]

list_c = []
list_a = [1, 2, 3, 4, 5]
list_b = [6, 7, 8, 9, 10]
for i in range(0, 5):
    list_kart_a_b = list_a[i], list_b[i]
    list_c.append(list(list_kart_a_b))

print('Задача 2', '\n', 'list_c =', sum(list_c, []))

# ==================================================================================================================
#  Задача 3     list_с_a = [2, 4]
#               list_c_b = [7, 9]

list_с_a = []
list_c_b = []
for l1 in list_a:
      if l1 % 2 == 0:
          list_с_a.append(l1)
print('Задача 3', '\n', 'list_c_a =', list_с_a)

for l2 in list_b:
      if l2 % 2 > 0:
          list_c_b.append(l2)
print(' list_c_b =', list_c_b)

# ==================================================================================================================
# Задача 4      list_d = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
list_c = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list_d = list_c[:]
list_d.reverse()
print('Задача 4', '\n', 'list_d =', list_d)

# ==================================================================================================================
# Задача 5      res = [11, 11, 11, 11, 11, 11, 11, 11, 11, 11]

res = []
for i in range(9):
    res.append(list_d[i]+list_c[i])
print('Задача 5', '\n', 'res = ', res)

# ==================================================================================================================
# Задача 6   res1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#            res2 = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
list_f = [9, 3, 4, 1, 8, 6, 5, 2, 0, 7]

res1 = list_f
res1 = sorted(list_f)
res1.remove(0)
res1.append(10)

res2 = list_f
res2.remove(0)
res2.append(10)
res2 = sorted(list_f, reverse=True)
print('Задача 6', '\n', 'res1 = ', res1, '\n', 'res2 = ', res2)

# ==================================================================================================================
# Задача 7     res = [(1, 10), (2, 9), (3, 8), (4, 7), (5, 6), (6, 5), (7, 4), (8, 3), (9, 2), (10, 1)]

res = []
for i in range(10):
    k = (list_c[i], list_d[i])
    res.append(k)
print('Задача 7', '\n', 'res =', res)
